<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Builds a package that installs Hugo.</string>
    <key>Identifier</key>
    <string>com.github.fseesink.pkg.Hugo</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Hugo</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.fseesink.download.Hugo</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
    </array>
</dict>
</plist>
