<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Sniffnet.</string>
	<key>Identifier</key>
	<string>com.github.fseesink.download.Sniffnet</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Sniffnet</string>
		<key>DOWNLOAD_ARCH</key>
		<!-- <string>Intel</string> -->
		<string>AppleSilicon</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>.*%DOWNLOAD_ARCH%\.dmg$</string>
				<key>github_repo</key>
				<string>GyulyVGC/sniffnet</string>
				<key>latest_only</key>
				<string>true</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
