<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of AnythingLLM and imports it into Munki.
	
Use either x86_64 or arm64 for ARCHITECTURE key.
Use either '' or '-Silicon' for DOWNLOAD_ARCH.
	</string>
	<key>Identifier</key>
	<string>com.github.fseesink.munki.AnythingLLM</string>
	<key>Input</key>
	<dict>
		<key>ARCHITECTURE</key>
		<string>arm64</string>
		<key>DOWNLOAD_ARCH</key>
		<string>-Silicon</string>
        <key>MUNKI_CATEGORY</key>
        <string>AI</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>AnythingLLM</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>A multi-user ChatGPT for any LLMs and vector database. Unlimited documents, messages, and storage in one privacy-focused app.</string>
			<key>developer</key>
			<string>Timothy Carambat</string>
			<key>display_name</key>
			<string>AnythingLLM</string>
			<key>name</key>
			<string>%NAME%</string>
            <key>supported_architectures</key>
            <array>
                <string>%ARCHITECTURE%</string>
            </array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.fseesink.download.AnythingLLM</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
