<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.5.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Installs the latest version of Luanti.</string>
	<key>Identifier</key>
	<string>com.github.fseesink.install.Luanti</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Luanti</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.fseesink.download.Luanti</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>FileMover</string>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Luanti.app</string>
				<key>target</key>
				<string>/Applications/Luanti.app</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
