<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Original recipes created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot) for Moonlight, then adjusted</string>
	<key>Description</key>
	<string>Installs the latest version of NetBird.</string>
	<key>Identifier</key>
	<string>com.github.fseesink.install.NetBird</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>NetBird</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>com.github.fseesink.download.NetBird</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
            </dict>
		</dict>
	</array>
</dict>
</plist>
