<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of Kompose and imports into Munki.</string>
        <key>Identifier</key>
        <string>com.github.fseesink.munki.Kompose</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Kompose</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/%NAME%</string>
            <key>SUPPORTED_ARCH</key>
            <!-- <string>x86_64</string> -->
            <string>arm64</string>
            <key>DOWNLOAD_ARCH</key>
            <!-- <string>amd64</string> -->
            <string>arm64</string>
            <key>MUNKI_CATEGORY</key>
            <string>Kubernetes</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>kompose is a tool to help users who are familiar with docker-compose move to Kubernetes. kompose takes a Compose Specification file and translates it into Kubernetes resources.&lt;br&gt;
                kompose is a convenience tool to go from local Compose environment to managing your application with Kubernetes.&lt;br&gt;
                Transformation of the Compose Specification format to Kubernetes resources manifest may not be exact, but it helps tremendously when first deploying an application on Kubernetes.</string>
                <key>developer</key>
                <string>The Linux Foundation</string>
                <key>display_name</key>
                <string>%NAME%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>supported_architectures</key>
                <array>
                    <string>%SUPPORTED_ARCH%</string>
                </array>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.fseesink.pkg.Kompose</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pkg_path%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
