<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Ferdium and imports it into Munki.
	
Use either x86_64 or arm64 for ARCHITECTURE key.
Use either x64 or arm64 for DOWNLOAD_ARCH
	</string>
	<key>Identifier</key>
	<string>com.github.fseesink.munki.Ferdium</string>
	<key>Input</key>
	<dict>
        <key>ARCHITECTURE</key>
        <string>x86_64</string>
		<key>DOWNLOAD_ARCH</key>
		<string>x64</string>
        <key>MUNKI_CATEGORY</key>
        <string>Network</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Ferdium</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>All your services in one place, built by the community</string>
			<key>developer</key>
			<string>Ambroise Grau</string>
			<key>display_name</key>
			<string>Ferdium</string>
			<key>name</key>
			<string>%NAME%</string>
            <key>supported_architectures</key>
            <array>
                <string>%ARCHITECTURE%</string>
            </array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.fseesink.download.Ferdium</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
