<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for oh-my-posh.</string>
        <key>Identifier</key>
        <string>com.github.fseesink.download.oh-my-posh</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>oh-my-posh</string>
            <key>DOWNLOAD_ARCH</key>
            <!-- <string>amd64</string> -->
            <string>arm64</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>GitHubReleasesInfoProvider</string>
                <key>Arguments</key>
                <dict>
                    <key>asset_regex</key>
                    <string>posh-darwin-%DOWNLOAD_ARCH%</string>
                    <key>github_repo</key>
                    <string>JanDeDobbeleer/oh-my-posh</string>
                    <key>latest_only</key>
                    <string>true</string>
                </dict>
            </dict>
            <!-- UNLIKE MOST APPS, OMP FILES ARE NOT COMPRESSED, SO WE JUST DOWNLOAD THEM. NO NEED FOR Unarchiver/etc. -->
            <!-- THE DOWNLOADED FILE SITS IN THE CACHE DIRECTORY UNDER 'downloads/' -->
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>oh-my-posh</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
        </array>
    </dict>
</plist>
