<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of go-blueprint and imports into Munki.</string>
        <key>Identifier</key>
        <string>com.github.fseesink.munki.go-blueprint</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>go-blueprint</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/%NAME%</string>
            <key>MUNKI_CATEGORY</key>
            <string>Programming</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>Go Blueprint is a CLI tool that allows users to spin up a Go project with the corresponding structure seamlessly. It also gives the option to integrate with one of the more popular Go frameworks (and the list is growing with new features)!</string>
                <key>developer</key>
                <string>Melkeydev</string>
                <key>display_name</key>
                <string>%NAME%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.fseesink.pkg.go-blueprint</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pkg_path%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
