<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Builds a package that installs Crush.</string>
        <key>Identifier</key>
        <string>com.github.fseesink.pkg.Crush</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Crush</string>
            <key>PKG_ID</key>
            <string>com.github.fseesink.pkg.Crush</string>
            <key>DOWNLOAD_ARCH</key>
            <string>arm64</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.fseesink.download.Crush</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>pkgdirs</key>
                    <dict>
                        <key>payload</key>
                        <string>0755</string>
                        <key>payload/usr</key>
                        <string>0755</string>
                        <key>payload/usr/local</key>
                        <string>0755</string>
                        <key>payload/usr/local/bin</key>
                        <string>0755</string>
                    </dict>
                </dict>
            </dict>
            <!-- DUE TO .tar.gz decompressing to a folder with a version number that changes, -->
            <!-- we will search for the file and store it in %found_filename%                 -->
            <dict>
                <key>Processor</key>
                <string>FileFinder</string>
                <key>Arguments</key>
                <dict>
                    <key>pattern</key>
                    <string>%RECIPE_CACHE_DIR%/unpacked/crush-*/crush</string>
                </dict>
            </dict>
            <!-- ONLY COPY THE EXECUTABLE FILE crush -->
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%found_filename%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%/payload/usr/local/bin/crush</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_request</key>
                    <dict>
                        <key>pkgroot</key>
                        <string>%RECIPE_CACHE_DIR%/%NAME%/payload</string>
                        <key>pkgdir</key>
                        <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                        <key>pkgname</key>
                        <string>%NAME%-%version%</string>
                        <key>id</key>
                        <string>%PKG_ID%</string>
                        <key>version</key>
                        <string>%version%</string>
                        <key>options</key>
                        <string>purge_ds_store</string>
                        <key>chown</key>
                        <array>
                            <dict>
                                <key>path</key>
                                <string>usr/local/bin/crush</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>wheel</string>
                                <key>mode</key>
                                <string>0755</string>
                            </dict>
                            <dict>
                                <key>path</key>
                                <string>usr/local/bin/crush</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>wheel</string>
                                <key>mode</key>
                                <string>0755</string>
                            </dict>
                        </array>
                    </dict>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
