<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of MediaHuman YouTube to MP3 and imports it into Munki.
	
Use either x86_64 or arm64 for ARCHITECTURE key.
Use either "" (blank) or "-arm" for DOWNLOAD_ARCH	
	</string>
	<key>Identifier</key>
	<string>com.github.fseesink.munki.MediaHuman-YouTubetoMP3</string>
	<key>Input</key>
	<dict>
        <key>ARCHITECTURE</key>
        <string>x86_64</string>
		<key>DOWNLOAD_ARCH</key>
		<string></string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>YouTube to MP3</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>MediaHuman YouTube to MP3 Converter - a free utility that, given a YouTube URL, will download the video and convert the audio to an MP3 file.  Website:  https://www.mediahuman.com/youtube-to-mp3/16/</string>
			<key>developer</key>
			<string>Viatcheslav Parygin</string>
			<key>display_name</key>
			<string>YouTube to MP3</string>
			<key>name</key>
			<string>%NAME%</string>
            <key>supported_architectures</key>
            <array>
                <string>%ARCHITECTURE%</string>
            </array>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.fseesink.download.MediaHuman-YouTubetoMP3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
