<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of MediaHuman YouTube to MP3.
	
DOWNLOAD_ARCH
- Set to blank for x86_64 (default)
- Set to "-arm" for Apple Silicon	
	</string>
	<key>Identifier</key>
	<string>com.github.fseesink.download.MediaHuman-YouTubetoMP3</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>YouTube to MP3</string>
        <key>DOWNLOAD_ARCH</key>
        <string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%%DOWNLOAD_ARCH%-%version%.dmg</string>
				<key>url</key>
				<string>https://www.mediahuman.com/download/YouTubeToMP3%DOWNLOAD_ARCH%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/YouTube to MP3.app</string>
				<key>requirement</key>
				<string>identifier "com.mediahuman.MediaHuman-YouTube to MP3" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "3EULEE7KQ5"</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pathname%/YouTube to MP3.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
