<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the current release version of Flux and imports into Munki.</string>
        <key>Identifier</key>
        <string>com.github.fseesink.munki.Flux</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Flux</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/%NAME%</string>
            <key>SUPPORTED_ARCH</key>
            <!-- <string>x86_64</string> -->
            <string>arm64</string>
            <key>DOWNLOAD_ARCH</key>
            <!-- <string>amd64</string> -->
            <string>arm64</string>
            <key>MUNKI_CATEGORY</key>
            <string>Kubernetes</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>%MUNKI_CATEGORY%</string>
                <key>description</key>
                <string>Flux is a tool for keeping Kubernetes clusters in sync with sources of configuration (like Git repositories and OCI artifacts), and automating updates to configuration when there is new code to deploy.&lt;br&gt;
                Flux version 2 ("v2") is built from the ground up to use Kubernetes' API extension system, and to integrate with Prometheus and other core components of the Kubernetes ecosystem.&lt;br&gt;
                In version 2, Flux supports multi-tenancy and support for syncing an arbitrary number of Git repositories, among other long-requested features.&lt;br&gt;
                Flux v2 is constructed with the GitOps Toolkit, a set of composable APIs and specialized tools for building Continuous Delivery on top of Kubernetes.&lt;br&gt;&lt;br&gt;
                Flux is a Cloud Native Computing Foundation (CNCF) graduated project, used in production by various organisations and cloud providers.</string>
                <key>developer</key>
                <string>The Flux authors</string>
                <key>display_name</key>
                <string>%NAME%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>supported_architectures</key>
                <array>
                    <string>%SUPPORTED_ARCH%</string>
                </array>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.fseesink.pkg.Flux</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pkg_path%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
