<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for ruff.</string>
        <key>Identifier</key>
        <string>com.github.fseesink.download.ruff</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>ruff</string>
            <key>DOWNLOAD_ARCH</key>
            <!-- <string>x86_64</string> -->
            <string>aarch64</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>GitHubReleasesInfoProvider</string>
                <key>Arguments</key>
                <dict>
                    <key>asset_regex</key>
                    <string>ruff-%DOWNLOAD_ARCH%-apple-darwin.tar.gz</string>
                    <key>github_repo</key>
                    <string>astral-sh/ruff</string>
                    <key>latest_only</key>
                    <string>true</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.tar.gz</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Unarchiver</string>
                <key>Arguments</key>
                <dict>
                    <key>archive_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpacked</string>
                    <key>purge_destination</key>
                    <true/>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
