<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Download recipe for glab.</string>
        <key>Identifier</key>
        <string>com.github.fseesink.download.glab</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>glab</string>
            <key>DOWNLOAD_ARCH</key>
            <!-- <string>amd64</string> -->
            <string>arm64</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.1</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://gitlab.com/gitlab-org/cli/-/releases</string>
                    <key>re_pattern</key>
                    <string>&lt;a href="(?P&lt;url&gt;https://gitlab.com/gitlab-org/cli/-/releases/v(?P&lt;version&gt;[0-9\.]*)/downloads/glab_[0-9\.]*_darwin_%DOWNLOAD_ARCH%.tar.gz)".*&gt;</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>URLDownloader</string>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%.tar.gz</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>io.github.hjuutilainen.SharedProcessors/ChecksumVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>algorithm</key>
                    <string>SHA256</string>
                    <key>checksum</key>
                    <string>%checksum%</string>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Unarchiver</string>
                <key>Arguments</key>
                <dict>
                    <key>archive_path</key>
                    <string>%pathname%</string>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/unpacked</string>
                    <key>purge_destination</key>
                    <true/>
                </dict>
            </dict>
        </array>
    </dict>
</plist>
